SPedt_!/src/Documents/УпаковатьЗаказы/УпаковатьЗаказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УпаковатьЗаказы</name>
  <registerRecords>AccumulationRegister.Транзит</registerRecords>
  <registerRecords>AccumulationRegister.УпакованныеЗаказы</registerRecords>
  <attributes>
    <name>ТочкаОтправитель</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаНазначения</name>
    <type>
      <types>CatalogRef.СегментыПунктовВыдачи</types>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьСупергруппы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Супергруппа</name>
    <type>
      <types>CatalogRef.Мегаордера</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияСупергруппы</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ГабаритСупергруппы</name>
    <type>
      <types>CatalogRef.Габариты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьИтого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоИтого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Покупки</name>
    <attributes>
      <name>Подбор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>DefinedType.ТипыЗаказа</types>
      </type>
    </attributes>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Габарит</name>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef.Движение</types>
        <types>DocumentRef.ФормированиеКоробки</types>
        <types>DocumentRef.ОтправлениеТранзита</types>
        <types>DocumentRef.Приходная</types>
        <types>DocumentRef.ПоступлениеПристроя</types>
        <types>DocumentRef.РазборКоробки</types>
        <types>DocumentRef.ЗаказыДляТранзита</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьХранения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяХранения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТочкаНазначения</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПраздничныхДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БесплатнаяВыдача</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SPedt_!/src/AccumulationRegisters/Транзит/Транзит.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Транзит</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПокупкаСсылка</name>
    <type>
      <types>DefinedType.ТипыЗаказа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Габарит</name>
    <type>
      <types>CatalogRef.Габариты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Точка</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.Движение</types>
      <types>DocumentRef.ФормированиеКоробки</types>
      <types>DocumentRef.КорректировкаЗаписейРегистров</types>
      <types>DocumentRef.ОтправлениеТранзита</types>
      <types>DocumentRef.ЗаказыДляТранзита</types>
      <types>DocumentRef.Приходная</types>
      <types>DocumentRef.ПоступлениеПристроя</types>
      <types>DocumentRef.РазборКоробки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

SPedt_!/src/Catalogs/Мегаордера/Мегаордера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Мегаордера</name>
  <predefined>
    <items>
      <name>нулевой</name>
    </items>
  </predefined>
  <attributes>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупка</name>
    <type>
      <types>CatalogRef.Покупки</types>
      <types>DocumentRef.ВыдачаТранзита</types>
      <types>CatalogRef.Заказы</types>
      <types>CatalogRef.Посылки</types>
      <types>CatalogRef.Пристрой</types>
      <types>CatalogRef.СобранныеЗаказы</types>
      <types>CatalogRef.Коробки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктВыдачи</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организатор</name>
    <type>
      <types>CatalogRef.Организаторы</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПерваяТочка</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>типМегаордера</name>
    <type>
      <types>EnumRef.типМегаордера</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Коробка</name>
    <type>
      <types>CatalogRef.Коробки</types>
    </type>
  </attributes>
  <attributes>
    <name>Посылка</name>
    <type>
      <types>CatalogRef.Посылки</types>
    </type>
  </attributes>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.ВыдачаТранзита</types>
      <types>DocumentRef.УпаковатьЗаказы</types>
    </type>
  </attributes>
  <attributes>
    <name>СобранныйЗаказ</name>
    <type>
      <types>CatalogRef.СобранныеЗаказы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Маршрут</name>
    <attributes>
      <name>ТранспортнаяКомпания</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ТрэкНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставкиПлан</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставкиФакт</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DefinedType.ТипыЗаказа</types>
      </type>
    </attributes>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SPedt_!/src/Documents/УпаковатьЗаказы/ManagerModule.bsl
// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	СтоСП_Печать.ДобавитьКомандыПечатиСупергрупп(КомандыПечати);		
КонецПроцедуры



#Область Проведение

Процедура 	ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	ТекстыЗапроса = Новый СписокЗначений;
//	СтоСПОбмен_Общий.Получить_ТекстЗапроса_Обмен100СП_РН(Запрос, ТекстыЗапроса, Регистры);
	Получить_ТекстЗапроса_Транзит(Запрос, ТекстыЗапроса, Регистры);
	Получить_ТекстЗапроса_УпакованныеЗаказы(Запрос, ТекстыЗапроса, Регистры);
	
	ПроведениеСервер.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	
	
КонецПроцедуры

Процедура 	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.ПометкаУдаления КАК ПометкаУдаления,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Период,
	|	ДанныеДокумента.Проведен КАК Проведен,
	|	ДанныеДокумента.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.УпаковатьЗаказы КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка";
	
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Период",                                                         Реквизиты.Период);
	Запрос.УстановитьПараметр("Номер",                         Реквизиты.Номер);
	Запрос.УстановитьПараметр("ИдентификаторМетаданных",       ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ПолноеИмяОбъекта()));
	Запрос.УстановитьПараметр("Комментарий",                   Реквизиты.Комментарий);
	Запрос.УстановитьПараметр("ПометкаУдаления",               Реквизиты.ПометкаУдаления);
	Запрос.УстановитьПараметр("Проведен",                      Реквизиты.Проведен);
	Запрос.УстановитьПараметр("КоличествоВДокументе",          Реквизиты.Проведен);
КонецПроцедуры

Функция 	Получить_ТекстЗапроса_Транзит(Запрос, ТекстыЗапроса, Регистры) Экспорт
	
	ИмяРегистра = "Транзит";
	
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если ТипЗнч(Запрос.Параметры.Ссылка)=Тип("ДокументСсылка.УпаковатьЗаказы") Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		               |	УпаковатьЗаказыПокупки.Ссылка.Дата КАК Период,
		               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		               |	УпаковатьЗаказыПокупки.Покупка КАК ПокупкаСсылка,
		               |	УпаковатьЗаказыПокупки.МестоХранения КАК МестоХранения,
		               |	УпаковатьЗаказыПокупки.Габарит КАК Габарит,
		               |	УпаковатьЗаказыПокупки.Участник КАК Участник,
		               |	ВЫБОР
		               |		КОГДА УпаковатьЗаказыПокупки.ТочкаНазначения = ЗНАЧЕНИЕ(Справочник.ТочкиРаздачи.ПустаяСсылка)
		               |			ТОГДА УпаковатьЗаказыПокупки.Ссылка.ТочкаНазначения
		               |		ИНАЧЕ УпаковатьЗаказыПокупки.ТочкаНазначения
		               |	КОНЕЦ КАК Точка,
		               |	УпаковатьЗаказыПокупки.Партия КАК Партия,
		               |	1 КАК Количество
		               |ИЗ
		               |	Документ.УпаковатьЗаказы.Покупки КАК УпаковатьЗаказыПокупки
		               |ГДЕ
		               |	УпаковатьЗаказыПокупки.Ссылка = &Ссылка
		               |	И УпаковатьЗаказыПокупки.Подбор";
	КонецЕсли;	

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции

Функция 	Получить_ТекстЗапроса_УпакованныеЗаказы(Запрос, ТекстыЗапроса, Регистры) Экспорт
	
	ИмяРегистра = "УпакованныеЗаказы";
	
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если ТипЗнч(Запрос.Параметры.Ссылка)=Тип("ДокументСсылка.УпаковатьЗаказы") Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		               |	УпаковатьЗаказыПокупки.Ссылка.Дата 				КАК Период,
		               |	УпаковатьЗаказыПокупки.Покупка 					КАК Покупка,
		               |	УпаковатьЗаказыПокупки.МестоХранения 			КАК МестоХранения,
		               |	УпаковатьЗаказыПокупки.Габарит 					КАК Габарит,
		               |	УпаковатьЗаказыПокупки.Участник 				КАК Участник,
		               |	ВЫБОР
		               |		КОГДА УпаковатьЗаказыПокупки.ТочкаНазначения = ЗНАЧЕНИЕ(Справочник.ТочкиРаздачи.ПустаяСсылка)
		               |			ТОГДА УпаковатьЗаказыПокупки.Ссылка.ТочкаНазначения
		               |		ИНАЧЕ УпаковатьЗаказыПокупки.ТочкаНазначения
		               |	КОНЕЦ КАК Точка,					   
		               |	УпаковатьЗаказыПокупки.Партия 					КАК Партия,
		               |	1 												КАК Количество
		               |ИЗ
		               |	Документ.УпаковатьЗаказы.Покупки КАК УпаковатьЗаказыПокупки
		               |ГДЕ
		               |	УпаковатьЗаказыПокупки.Ссылка = &Ссылка
		               |	И УпаковатьЗаказыПокупки.Подбор
		               |	И не УпаковатьЗаказыПокупки.Ссылка.КонтролироватьСупергруппы
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	УпаковатьЗаказы.Дата,
		               |	УпаковатьЗаказы.Супергруппа,
		               |	УпаковатьЗаказы.МестоХраненияСупергруппы,
		               |	УпаковатьЗаказы.ГабаритСупергруппы,
		               |	ЗНАЧЕНИЕ(Справочник.Участники.Нулевой),
		               |	УпаковатьЗаказы.ТочкаНазначения,
		               |	УпаковатьЗаказы.Ссылка,
		               |	1
		               |ИЗ
		               |	Документ.УпаковатьЗаказы КАК УпаковатьЗаказы
		               |ГДЕ
		               |	УпаковатьЗаказы.Ссылка = &Ссылка
		               |	И УпаковатьЗаказы.КонтролироватьСупергруппы
		               |	И УпаковатьЗаказы.Супергруппа <> ЗНАЧЕНИЕ(Справочник.Мегаордера.ПустаяСсылка)";
	КонецЕсли;	

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти

Функция ПолноеИмяОбъекта()
	Возврат "Документ.УпаковатьЗаказы";
КонецФункции



Процедура ПроверитьНаличие(Объект,Отказ)      Экспорт
	Если Не Константы.КонтралироватьОстаткиПриРасходе.Получить() 
		Тогда  Возврат; КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Покупки.НомерСтроки КАК НомерСтроки,
		|	Покупки.Габарит КАК Габарит,
		|	Покупки.Количество КАК Количество,
		|	Покупки.МестоХранения КАК МестоХранения,
		|	Покупки.Партия КАК Партия,
		|	Покупки.Покупка КАК ПокупкаСсылка,
		|	Покупки.Участник КАК Участник,
		|	Покупки.ТочкаНазначения КАК Точка
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&Покупки КАК Покупки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВТ.НомерСтроки) КАК НомерСтроки,
		|	ВТ.Габарит КАК Габарит,
		|	СУММА(ВТ.Количество) КАК Количество,
		|	ВТ.МестоХранения КАК МестоХранения,
		|	ВТ.Партия КАК Партия,
		|	ВТ.ПокупкаСсылка КАК ПокупкаСсылка,
		|	ВТ.Участник КАК Участник,
		|	ВТ.Точка КАК Точка
		|ПОМЕСТИТЬ ВТГруппа
		|ИЗ
		|	ВТ КАК ВТ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.Точка,
		|	ВТ.Участник,
		|	ВТ.Габарит,
		|	ВТ.МестоХранения,
		|	ВТ.Партия,
		|	ВТ.ПокупкаСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТГруппа.НомерСтроки КАК НомерСтроки,
		|	ВТГруппа.Габарит КАК Габарит,
		|	ВТГруппа.Количество КАК Количество,
		|	ВТГруппа.МестоХранения КАК МестоХранения,
		|	ВТГруппа.Партия КАК Партия,
		|	ВТГруппа.ПокупкаСсылка КАК ПокупкаСсылка,
		|	ВТГруппа.Участник КАК Участник,
		|	ВТГруппа.Точка КАК Точка,
		|	ЕСТЬNULL(ТранзитОстатки.КоличествоОстаток, 0) КАК КоличествоНаСкладе
		|ПОМЕСТИТЬ СОстатками
		|ИЗ
		|	ВТГруппа КАК ВТГруппа
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Транзит.Остатки(&НаДату, ) КАК ТранзитОстатки
		|		ПО ВТГруппа.Участник = ТранзитОстатки.Участник
		|			И ВТГруппа.ПокупкаСсылка = ТранзитОстатки.ПокупкаСсылка
		|			И ВТГруппа.МестоХранения = ТранзитОстатки.МестоХранения
		|			И ВТГруппа.Габарит = ТранзитОстатки.Габарит
		|			И ВТГруппа.Партия = ТранзитОстатки.Партия
		|			И ВТГруппа.Точка = ТранзитОстатки.Точка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	Транзит.Габарит,
		|	Транзит.Количество * -1,
		|	Транзит.МестоХранения,
		|	Транзит.Партия,
		|	Транзит.ПокупкаСсылка,
		|	Транзит.Участник,
		|	Транзит.Точка,
		|	0
		|ИЗ
		|	РегистрНакопления.Транзит КАК Транзит
		|ГДЕ
		|	Транзит.Регистратор = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СОстатками.Габарит КАК Габарит,
		|	СУММА(СОстатками.Количество) КАК Количество,
		|	СОстатками.МестоХранения КАК МестоХранения,
		|	СОстатками.Партия КАК Партия,
		|	СОстатками.ПокупкаСсылка КАК ПокупкаСсылка,
		|	СОстатками.Участник КАК Участник,
		|	СОстатками.Точка КАК Точка,
		|	СУММА(СОстатками.КоличествоНаСкладе) КАК КоличествоНаОстатках,
		|	МАКСИМУМ(СОстатками.НомерСтроки) КАК НомерСтроки
		|ИЗ
		|	СОстатками КАК СОстатками
		|
		|СГРУППИРОВАТЬ ПО
		|	СОстатками.Габарит,
		|	СОстатками.МестоХранения,
		|	СОстатками.Участник,
		|	СОстатками.ПокупкаСсылка,
		|	СОстатками.Точка,
		|	СОстатками.Партия
		|
		|ИМЕЮЩИЕ
		|	СУММА(СОстатками.Количество) > 0 И
		|	СУММА(СОстатками.Количество) > СУММА(СОстатками.КоличествоНаСкладе)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";

	ТаблицаПокупокДокумента=Объект.Покупки.Выгрузить();
	ТаблицаПокупокДокумента.Колонки.Добавить("ТочкаНазначения",новый ОписаниеТипов("СправочникСсылка.ТочкиРаздачи"));
	ТаблицаПокупокДокумента.ЗаполнитьЗначения(Объект.ТочкаНазначения,"ТочкаНазначения");

	Запрос.УстановитьПараметр("Покупки",ТаблицаПокупокДокумента);
	Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	Запрос.УстановитьПараметр("НаДату",Объект.Дата);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Ошибки=неопределено;
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,"Объект.Покупки["+(Выборка.НомерСтроки-1)+"].Количество",
		"В строке: "+Выборка.НомерСтроки+". На складе: "+Выборка.КоличествоНаОстатках+" шт. из требуемых: "+Выборка.Количество,,Выборка.НомерСтроки-1);
	КонецЦикла;
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки,Отказ);
	
КонецПроцедуры
